tests/testthat/test_dataset/measurements.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/"><SOAP:Body><d2LogicalModel xmlns="http://datex2.eu/schema/2/2_0" modelBaseVersion="2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><exchange><supplierIdentification><country>nl</country><nationalIdentifier>NLNDW</nationalIdentifier></supplierIdentification></exchange><payloadPublication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="MeasurementSiteTablePublication" lang="nl"><publicationTime>2020-12-22T12:00:00.000Z</publicationTime><publicationCreator><country>nl</country><nationalIdentifier>NLNDW</nationalIdentifier></publicationCreator><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><measurementSiteTable id="NDW01_MT" version="1252"><measurementSiteRecord id="PZH01_MST_0687_01" version="12"><measurementSiteRecordVersionTime>2020-06-18T00:08:34Z</measurementSiteRecordVersionTime><computationMethod>arithmeticAverageOfSamplesInATimePeriod</computationMethod><measurementEquipmentReference>0687_01</measurementEquipmentReference><measurementEquipmentTypeUsed><values><value lang="nl">lus</value></values></measurementEquipmentTypeUsed><measurementSiteName><values><value lang="nl">N450 km 2.735</value></values></measurementSiteName><measurementSiteNumberOfLanes>1</measurementSiteNumberOfLanes><measurementSide>northEastBound</measurementSide><measurementSpecificCharacteristics index="1"><measurementSpecificCharacteristics><accuracy>95</accuracy><period>60</period><specificLane>lane1</specificLane><specificMeasurementValueType>trafficFlow</specificMeasurementValueType><specificVehicleCharacteristics><lengthCharacteristic><comparisonOperator>lessThan</comparisonOperator><vehicleLength>5.6</vehicleLength></lengthCharacteristic></specificVehicleCharacteristics></measurementSpecificCharacteristics></measurementSpecificCharacteristics><measurementSpecificCharacteristics index="2"><measurementSpecificCharacteristics><accuracy>95</accuracy><period>60</period><specificLane>lane1</specificLane><specificMeasurementValueType>trafficFlow</specificMeasurementValueType><specificVehicleCharacteristics><lengthCharacteristic><comparisonOperator>greaterThanOrEqualTo</comparisonOperator><vehicleLength>5.6</vehicleLength></lengthCharacteristic><lengthCharacteristic><comparisonOperator>lessThanOrEqualTo</comparisonOperator><vehicleLength>12.2</vehicleLength></lengthCharacteristic></specificVehicleCharacteristics></measurementSpecificCharacteristics></measurementSpecificCharacteristics><measurementSpecificCharacteristics index="3"><measurementSpecificCharacteristics><accuracy>95</accuracy><period>60</period><specificLane>lane1</specificLane><specificMeasurementValueType>trafficFlow</specificMeasurementValueType><specificVehicleCharacteristics><lengthCharacteristic><comparisonOperator>greaterThan</comparisonOperator><vehicleLength>12.2</vehicleLength></lengthCharacteristic></specificVehicleCharacteristics></measurementSpecificCharacteristics></measurementSpecificCharacteristics><measurementSpecificCharacteristics index="4"><measurementSpecificCharacteristics><accuracy>95</accuracy><period>60</period><specificLane>lane1</specificLane><specificMeasurementValueType>trafficFlow</specificMeasurementValueType><specificVehicleCharacteristics><vehicleType>anyVehicle</vehicleType></specificVehicleCharacteristics></measurementSpecificCharacteristics></measurementSpecificCharacteristics><measurementSpecificCharacteristics index="5"><measurementSpecificCharacteristics><accuracy>95</accuracy><period>60</period><specificLane>lane1</specificLane><specificMeasurementValueType>trafficSpeed</specificMeasurementValueType><specificVehicleCharacteristics><lengthCharacteristic><comparisonOperator>lessThan</comparisonOperator><vehicleLength>5.6</vehicleLength></lengthCharacteristic></specificVehicleCharacteristics></measurementSpecificCharacteristics></measurementSpecificCharacteristics><measurementSpecificCharacteristics index="6"><measurementSpecificCharacteristics><accuracy>95</accuracy><period>60</period><specificLane>lane1</specificLane><specificMeasurementValueType>trafficSpeed</specificMeasurementValueType><specificVehicleCharacteristics><lengthCharacteristic><comparisonOperator>greaterThanOrEqualTo</comparisonOperator><vehicleLength>5.6</vehicleLength></lengthCharacteristic><lengthCharacteristic><comparisonOperator>lessThanOrEqualTo</comparisonOperator><vehicleLength>12.2</vehicleLength></lengthCharacteristic></specificVehicleCharacteristics></measurementSpecificCharacteristics></measurementSpecificCharacteristics><measurementSpecificCharacteristics index="7"><measurementSpecificCharacteristics><accuracy>95</accuracy><period>60</period><specificLane>lane1</specificLane><specificMeasurementValueType>trafficSpeed</specificMeasurementValueType><specificVehicleCharacteristics><lengthCharacteristic><comparisonOperator>greaterThan</comparisonOperator><vehicleLength>12.2</vehicleLength></lengthCharacteristic></specificVehicleCharacteristics></measurementSpecificCharacteristics></measurementSpecificCharacteristics><measurementSpecificCharacteristics index="8"><measurementSpecificCharacteristics><accuracy>95</accuracy><period>60</period><specificLane>lane1</specificLane><specificMeasurementValueType>trafficSpeed</specificMeasurementValueType><specificVehicleCharacteristics><vehicleType>anyVehicle</vehicleType></specificVehicleCharacteristics></measurementSpecificCharacteristics></measurementSpecificCharacteristics><measurementSiteLocation xsi:type="Point"><locationForDisplay><latitude>52.23634</latitude><longitude>4.503404</longitude></locationForDisplay><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>mainCarriageway</carriageway></affectedCarriagewayAndLanes></supplementaryPositionalDescription><alertCPoint xsi:type="AlertCMethod4Point"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>5.21</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>negative</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>15781</specificLocation></alertCLocation><offsetDistance><offsetDistance>327</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation></alertCPoint><pointExtension><openlrExtendedPoint><openlrPointLocationReference><openlrGeoCoordinate><openlrCoordinate><latitude>52.2379341</latitude><longitude>4.506579</longitude></openlrCoordinate></openlrGeoCoordinate><openlrPointAlongLine><openlrSideOfRoad>onRoadOrUnknown</openlrSideOfRoad><openlrOrientation>noOrientationOrUnknown</openlrOrientation><openlrPositiveOffset>281</openlrPositiveOffset><openlrLocationReferencePoint><openlrCoordinate><latitude>52.2379341</latitude><longitude>4.506579</longitude></openlrCoordinate><openlrLineAttributes><openlrFunctionalRoadClass>FRC4</openlrFunctionalRoadClass><openlrFormOfWay>singleCarriageway</openlrFormOfWay><openlrBearing>230</openlrBearing></openlrLineAttributes><openlrPathAttributes><openlrLowestFRCToNextLRPoint>FRC4</openlrLowestFRCToNextLRPoint><openlrDistanceToNextLRPoint>430</openlrDistanceToNextLRPoint></openlrPathAttributes></openlrLocationReferencePoint><openlrLastLocationReferencePoint><openlrCoordinate><latitude>52.235508</latitude><longitude>4.501682</longitude></openlrCoordinate><openlrLineAttributes><openlrFunctionalRoadClass>FRC4</openlrFunctionalRoadClass><openlrFormOfWay>singleCarriageway</openlrFormOfWay><openlrBearing>51</openlrBearing></openlrLineAttributes></openlrLastLocationReferencePoint></openlrPointAlongLine></openlrPointLocationReference></openlrExtendedPoint></pointExtension></measurementSiteLocation></measurementSiteRecord></measurementSiteTable></payloadPublication></d2LogicalModel></SOAP:Body></SOAP:Envelope>
